Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_emac.c
  *regValue = BL_RD_REG(EMAC_BASE, EMAC_MIIRX_DATA);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Write PHY register
                                                                                *
                                                                                * @param  phyReg: PHY register
                                                                                * @param  regValue: PHY register value
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_Phy_Write(uint16_t phyReg, uint16_t regValue) {
  uint32_t tmpVal;

  /* Set Register Address */
  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_MIIADDRESS);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_RGAD, phyReg);
  BL_WR_REG(EMAC_BASE, EMAC_MIIADDRESS, tmpVal);

  /* Set Write data */
  BL_WR_REG(EMAC_BASE, EMAC_MIITX_DATA, regValue);

  /* Trigger write */
  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_MIICOMMAND);
  tmpVal = BL_SET_REG_BIT(tmpVal, EMAC_WCTRLDATA);
  BL_WR_REG(EMAC_BASE, EMAC_MIICOMMAND, tmpVal);

  BL_DRV_DUMMY;

  do {
    tmpVal = BL_RD_REG(EMAC_BASE, EMAC_MIISTATUS);
  } while (BL_IS_REG_BIT_SET(tmpVal, EMAC_MIIM_BUSY));

  return SUCCESS;
}

/*@} end of group EMAC_Private_Functions */

/** @defgroup  EMAC_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  Initialize EMAC module
                                                                                *
                                                                                * @param  cfg: EMAC configuration pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_Init(EMAC_CFG_Type *cfg) {
  uint32_t tmpVal;

  /* Disable clock gate */
  GLB_AHB_Slave1_Clock_Gate(DISABLE, BL_AHB_SLAVE1_EMAC);

  /* Set MAC config */
  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_MODE);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_RMII_EN, 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_RECSMALL, cfg->recvSmallFrame);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_PAD, cfg->padEnable);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_HUGEN, cfg->recvHugeFrame);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_CRCEN, cfg->crcEnable);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_NOPRE, cfg->noPreamble);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_BRO, cfg->recvBroadCast);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_PRO, ENABLE);
  // tmpVal |= (1 << 7); /* local loopback in emac */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_IFG, cfg->interFrameGapCheck);
  BL_WR_REG(EMAC_BASE, EMAC_MODE, tmpVal);

  /* Set inter frame gap value */
  BL_WR_REG(EMAC_BASE, EMAC_IPGT, cfg->interFrameGapValue);

  /* Set MII interface */
  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_MIIMODE);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_MIINOPRE, cfg->miiNoPreamble);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_CLKDIV, cfg->miiClkDiv);
  BL_WR_REG(EMAC_BASE, EMAC_MIIMODE, tmpVal);

  /* Set collision */
  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_COLLCONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_MAXRET, cfg->maxTxRetry);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_COLLVALID, cfg->collisionValid);
  BL_WR_REG(EMAC_BASE, EMAC_COLLCONFIG, tmpVal);

  /* Set frame length */
  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_PACKETLEN);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_MINFL, cfg->minFrameLen);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_MAXFL, cfg->maxFrameLen);
  BL_WR_REG(EMAC_BASE, EMAC_PACKETLEN, tmpVal);

  EMAC_SetMACAddress(cfg->macAddr);

  void EMAC_IRQHandler(void);
  Interrupt_Handler_Register(EMAC_IRQn, EMAC_IRQHandler);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  DeInitialize EMAC module
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_DeInit(void) {
  EMAC_Disable();

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Initialize EMAC TX RX MDA buffer
                                                                                *
                                                                                * @param  handle: EMAC handle pointer
                                                                                * @param  txBuff: TX buffer
                                                                                * @param  txBuffCount: TX buffer count
                                                                                * @param  rxBuff: RX buffer
                                                                                * @param  rxBuffCount: RX buffer count
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_DMADescListInit(EMAC_Handle_Type *handle, uint8_t *txBuff, uint32_t txBuffCount, uint8_t *rxBuff, uint32_t rxBuffCount) {
  uint32_t i = 0;

  /* Set the Ethernet handler env */
  handle->bd          = (EMAC_BD_Desc_Type *)(EMAC_BASE + EMAC_DMA_DESC_OFFSET);
  handle->txIndexEMAC = 0;
  handle->txIndexCPU  = 0;
  handle->txBuffLimit = txBuffCount - 1;
  /* The receive descriptors' address starts right after the last transmit BD. */
  handle->rxIndexEMAC = txBuffCount;
  handle->rxIndexCPU  = txBuffCount;
  handle->rxBuffLimit = txBuffCount + rxBuffCount - 1;

  /* Fill each DMARxDesc descriptor with the right values */
  for (i = 0; i < txBuffCount; i++) {
    /* Get the pointer on the ith member of the Tx Desc list */
    handle->bd[i].Buffer = (NULL == txBuff) ? 0 : (uint32_t)(txBuff + (ETH_MAX_PACKET_SIZE * i));
    handle->bd[i].C_S_L  = 0;
  }

