Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_emac.c
  /* For the last TX DMA Descriptor, it should be wrap back */
  handle->bd[handle->txBuffLimit].C_S_L |= EMAC_BD_FIELD_MSK(TX_WR);

  for (i = txBuffCount; i < (txBuffCount + rxBuffCount); i++) {
    /* Get the pointer on the ith member of the Rx Desc list */
    handle->bd[i].Buffer = (NULL == rxBuff) ? 0 : (uint32_t)(rxBuff + (ETH_MAX_PACKET_SIZE * (i - txBuffCount)));
    handle->bd[i].C_S_L  = (ETH_MAX_PACKET_SIZE << 16) | EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E);
  }

  /* For the last RX DMA Descriptor, it should be wrap back */
  handle->bd[handle->rxBuffLimit].C_S_L |= EMAC_BD_FIELD_MSK(RX_WR);

  /* For the TX DMA Descriptor, it will wrap to 0 according to EMAC_TX_BD_NUM*/
  BL_WR_REG(EMAC_BASE, EMAC_TX_BD_NUM, txBuffCount);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Get TX MDA buffer descripter for data to send
                                                                                *
                                                                                * @param  handle: EMAC handle pointer
                                                                                * @param  txDMADesc: TX DMA descriptor pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_DMATxDescGet(EMAC_Handle_Type *handle, EMAC_BD_Desc_Type **txDMADesc) { return SUCCESS; }

/****************************************************************************/ /**
                                                                                * @brief  Start TX
                                                                                *
                                                                                * @param  handle: EMAC handle pointer
                                                                                * @param  txDMADesc: TX DMA descriptor pointer
                                                                                * @param  len: len
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_StartTx(EMAC_Handle_Type *handle, EMAC_BD_Desc_Type *txDMADesc, uint32_t len) { return SUCCESS; }

/****************************************************************************/ /**
                                                                                * @brief  Enable EMAC module
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_Enable(void) {
  uint32_t tmpVal;

  /* Enable EMAC */
  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_MODE);
  tmpVal = BL_SET_REG_BIT(tmpVal, EMAC_TXEN);
  tmpVal = BL_SET_REG_BIT(tmpVal, EMAC_RXEN);
  BL_WR_REG(EMAC_BASE, EMAC_MODE, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  EMAC_Enable_TX
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_Enable_TX(void) {
  uint32_t tmpVal;

  /* Enable EMAC */
  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_MODE);
  tmpVal = BL_SET_REG_BIT(tmpVal, EMAC_TXEN);
  BL_WR_REG(EMAC_BASE, EMAC_MODE, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  EMAC_Disable_TX
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_Disable_TX(void) {
  uint32_t tmpVal;

  /* Enable EMAC */
  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_MODE);
  tmpVal = BL_CLR_REG_BIT(tmpVal, EMAC_TXEN);
  BL_WR_REG(EMAC_BASE, EMAC_MODE, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  EMAC_Enable_RX
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_Enable_RX(void) {
  uint32_t tmpval;

