Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_emac.c
  /* Enable EMAC TX*/
  tmpval = BL_RD_REG(EMAC_BASE, EMAC_MODE);
  tmpval = BL_SET_REG_BIT(tmpval, EMAC_RXEN);
  BL_WR_REG(EMAC_BASE, EMAC_MODE, tmpval);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  EMAC_Disable_RX
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_Disable_RX(void) {
  uint32_t tmpval;

  /* Disable EMAC RX*/
  tmpval = BL_RD_REG(EMAC_BASE, EMAC_MODE);
  tmpval = BL_CLR_REG_BIT(tmpval, EMAC_RXEN);
  BL_WR_REG(EMAC_BASE, EMAC_MODE, tmpval);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Disable EMAC module
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_Disable(void) {
  uint32_t tmpVal;

  /* Enable EMAC */
  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_MODE);
  tmpVal = BL_CLR_REG_BIT(tmpVal, EMAC_TXEN);
  tmpVal = BL_CLR_REG_BIT(tmpVal, EMAC_RXEN);
  BL_WR_REG(EMAC_BASE, EMAC_MODE, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  EMAC mask or unmask certain or all interrupt
                                                                                *
                                                                                * @param  intType: EMAC interrupt type
                                                                                * @param  intMask: EMAC interrupt mask value( MASK:disbale interrupt,UNMASK:enable interrupt )
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_IntMask(EMAC_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_INT_MASK);

  /* Mask or unmask certain or all interrupt */
  if (MASK == intMask) {
    tmpVal |= intType;
  } else {
    tmpVal &= (~intType);
  }

  /* Write back */
  BL_WR_REG(EMAC_BASE, EMAC_INT_MASK, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Get EMAC interrupt status
                                                                                *
                                                                                * @param  intType: EMAC interrupt type
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type EMAC_GetIntStatus(EMAC_INT_Type intType) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_EMAC_INT_TYPE(intType));

  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_INT_SOURCE);

  return (tmpVal & intType) ? SET : RESET;
}

/****************************************************************************/ /**
                                                                                * @brief  Clear EMAC interrupt
                                                                                *
                                                                                * @param  intType: EMAC interrupt type
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_ClrIntStatus(EMAC_INT_Type intType) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_EMAC_INT_TYPE(intType));

  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_INT_SOURCE);

  BL_WR_REG(EMAC_BASE, EMAC_INT_SOURCE, tmpVal | intType);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  EMAC_Int_Callback_Install
                                                                                *
                                                                                * @param  intIdx: EMAC_INT_Index
                                                                                * @param  cbFun: call back
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_Int_Callback_Install(EMAC_INT_Index intIdx, intCallback_Type *cbFun) {
  /* Check the parameters */

