Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_emac.c
  emacIntCbfArra[intIdx] = cbFun;

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  EMAC_IRQHandler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void EMAC_IRQHandler(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(EMAC_BASE, EMAC_INT_MASK);

  if (SET == EMAC_GetIntStatus(EMAC_INT_TX_DONE) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_TXB_M)) {
    EMAC_ClrIntStatus(EMAC_INT_TX_DONE);

    if (emacIntCbfArra[EMAC_INT_TX_DONE_IDX]) {
      emacIntCbfArra[EMAC_INT_TX_DONE_IDX]();
    }
  }

  if (SET == EMAC_GetIntStatus(EMAC_INT_TX_ERROR) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_TXE_M)) {
    EMAC_ClrIntStatus(EMAC_INT_TX_ERROR);

    if (emacIntCbfArra[EMAC_INT_TX_ERROR_IDX]) {
      emacIntCbfArra[EMAC_INT_TX_ERROR_IDX]();
    }
  }

  if (SET == EMAC_GetIntStatus(EMAC_INT_RX_DONE) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_RXB_M)) {
    EMAC_ClrIntStatus(EMAC_INT_RX_DONE);

    if (emacIntCbfArra[EMAC_INT_RX_DONE_IDX]) {
      emacIntCbfArra[EMAC_INT_RX_DONE_IDX]();
    }
  }

  if (SET == EMAC_GetIntStatus(EMAC_INT_RX_ERROR) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_RXE_M)) {
    EMAC_ClrIntStatus(EMAC_INT_RX_ERROR);

    if (emacIntCbfArra[EMAC_INT_RX_ERROR_IDX]) {
      emacIntCbfArra[EMAC_INT_RX_ERROR_IDX]();
    }
  }

  if (SET == EMAC_GetIntStatus(EMAC_INT_RX_BUSY) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_BUSY_M)) {
    EMAC_ClrIntStatus(EMAC_INT_RX_BUSY);

    if (emacIntCbfArra[EMAC_INT_RX_BUSY_IDX]) {
      emacIntCbfArra[EMAC_INT_RX_BUSY_IDX]();
    }
  }

  if (SET == EMAC_GetIntStatus(EMAC_INT_TX_CTRL) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_TXC_M)) {
    EMAC_ClrIntStatus(EMAC_INT_TX_CTRL);

    if (emacIntCbfArra[EMAC_INT_TX_CTRL_IDX]) {
      emacIntCbfArra[EMAC_INT_TX_CTRL_IDX]();
    }
  }

  if (SET == EMAC_GetIntStatus(EMAC_INT_RX_CTRL) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_RXC_M)) {
    EMAC_ClrIntStatus(EMAC_INT_RX_CTRL);

    if (emacIntCbfArra[EMAC_INT_RX_CTRL_IDX]) {
      emacIntCbfArra[EMAC_INT_RX_CTRL_IDX]();
    }
  }
}

/****************************************************************************/ /**
                                                                                * @brief  Request to pause TX
                                                                                *
                                                                                * @param  timeCount: Pause time count
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_TxPauseReq(uint16_t timeCount) {
  BL_WR_REG(EMAC_BASE, EMAC_TXCTRL, (1 << 16) | timeCount);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Set hash value
                                                                                *
                                                                                * @param  hash0: Hash value one
                                                                                * @param  hash1: Hash value two
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type EMAC_SetHash(uint32_t hash0, uint32_t hash1) {
  BL_WR_REG(EMAC_BASE, EMAC_HASH0_ADDR, hash0);

  BL_WR_REG(EMAC_BASE, EMAC_HASH1_ADDR, hash1);

  return SUCCESS;
}

/*@} end of group EMAC_Public_Functions */

/*@} end of group EMAC */

/*@} end of group BL702_Peripheral_Driver */
